# Задание:
# Написать скрипт в любой парадигме, 
# который выводит на экран таблицу умножения всех чисел от 1 до n.
# Обоснуйте выбор парадигм.

# Решение: 
# Для написания скрипта я использовала структурную парадигму программирования, 
# т.к. мне известно что расширять данный скрипт мы не планируем, следовательно не 
# вижу смысла расписывать на несколько процедур это маленький код.

try:
    n = int(input('Введите число: '))
except (Exception):
    print('Число введено не верно')
else:
    num = 1
    while num <= n:
        for i in range(1, 10):
            print(f'{num} * {i} = {num*i}')
        print('\n')
        num += 1